'''Написать свой модуль utils и копировать в него функцию currency_rates() из предыдущего задания.
Создать в корневой директории урока, рядом с модулем utils скрипт task_4_4.py, в котором импортировать
модуль utils и выполнить несколько вызовов функции utils.currency_rates().
Убедиться, что ничего лишнего не происходит'''


import task_4_2


print(task_4_2.currency_rates('usd'))